{
  "collected": "Собрано {0} для инвалидов",
  "search": "Поиск",
  "VK": "Вконтакте",
  "instagram": "Instagram",
  "login": "Войти",
  "give_help": "Хочу помочь",
  "get_help": "Получить помощь",
  "links": {
    "fees": "Сборы",
    "projects": "Проекты",
    "reports": "Отчеты",
    "news": "Новости",
    "about": "О фонде",
    "pay": "Выплатить",
    "volunteers": "Волонтеры сайта"
  },
  "copyright": "БФ при ДУМ РТ «Закят»",
  "home": {
    "about": {
      "title": "О фонде",
      "paragraph1": " Благотворительный фонд «Закят» учрежден Централизованной Религиозной Организацией Духовного управления мусульман в Республике Татарстан в 1998 году. БФ «Закят» занимается сбором и распределением Закята и Садака в Республике Татарстан. Деятельность по сбору Закята и Садака осуществляют специалисты фонда. Распределение Закята и Садака осуществляется по решению комиссии. Консультации по осуществлению деятельности фонда оказывает Совет Улемов ЦРО-ДУМ РТ.",
      "paragraph2": " Благотворительный фонд «Закят» занимается оказанием помощи самым незащищенным слоям населения: многодетным, малоимущим семьям, попавшим в трудную жизненную ситуацию; сиротам и одиноким пожилым людям. Так же фонд занимается сбором средств и помогает в оплате лечения тяжелобольным детям и взрослым.",
      "learn_more": "Узнать подробнее"
    },
    "slideshow": {
      "collected": "Собрано",
      "remaining": "Осталось",
      "required": "Необходимо",
      "donate": "Пожертвовать"
    },
    "sadaka": {
      "title": "Совершите Садака",
      "description": "Садака — добровольная милостыня, которую выплачивают нуждающимся по собственному усмотрению и желанию. Любое ваше благодеяние, совершенное искренне, мы распределим между нуждающимися.",
      "enter_amount": "Введите сумму",
      "donate": "Пожертвовать"
    },
    "partners": {
      "title": "Партнеры"
    },
    "zakat": {
      "title": "Выплатите Закят",
      "description": "Закят — обязательный ежегодный налог, выплачиваемый с различного вида доходов всеми дееспособными и взрослыми мусульманами в пользу нуждающихся единоверцев.",
      "pay": "Выплатите Закят"
    },
    "volunteer": {
      "title": "Станьте другом–волонтером фонда",
      "description": "Если вы хотите поднимать настроение нуждающимся и делать их жизнь лучше, мы с радостью примем вас в нашу дружную команду единомышленников. Оставьте контактные данные и расскажите как вы хотите оказывать помощь.  Мы свяжемся с вами как только рассмотрим ваше предложение!",
      "join": "Стать волонтером"
    },
    "funded_project": {
      "title": "Вы помогли, Спасибо!"
    },
    "projects": {
      "title": "Проекты",
      "help": "Хочу помочь"
    }
  },
  "ZakatPage":{
    "title":"Закят"
    
  }
}
