<template>
  <div>
    <v-row justify="center">
      <v-expansion-panels popout>
        <v-expansion-panel
          v-for="question in questions"
          :key="question.questiontext"
        >
          <v-expansion-panel-header>{{question.question}}</v-expansion-panel-header>
          <v-expansion-panel-content>{{question.answer}}</v-expansion-panel-content>
        </v-expansion-panel>
      </v-expansion-panels>
    </v-row>
  </div>
</template>
<script lang="ts">
import Vue from 'vue';
export default Vue.extend({
  components: {
  },
  data () {
    return {
      questions: [
      {"question":"Необходимо ли выплачивать закят с имущества обеспеченных детей, не достигших религиозного совершеннолетия (половой зрелости)?",
        "answer":"Для того чтобы некто был обязан выплачивать закят, он должен быть разумным и совершеннолетним с точки зрения религии. Согласно ханафитскому мазхабу, нет необходимости в том, чтобы выплачивать закят с имущества несовершеннолетних детей, даже если они являются богатыми. Однако должен выплачиваться ушр с урожая, собранного с земли, принадлежащей этим детям."},
      {"question":"Обязан ли человек, проживающий со своим отцом, выплачивать закят?",
        "answer":"В Исламе основой является индивидуальность имущества. Согласно чему, если некий человек обладает имуществом, соответствующим нисабу, на него распространяется обязанность по выплате закята, даже если он проживает вместе со своим отцом. Однако в случае, если такой человек не распределил имущество с отцом, они вместе зарабатывают и вместе тратят, обязанность по выплате закята ложится на плечи того, кто этим имуществом распоряжается."},
      {"question":"Что относится к основным потребностям жизнедеятельности (аль-хаваидж аль-аслийя)?",
        "answer":"В Исламе в случае с выплатой закята, как и в иных случаях, связанных с телесными и имущественными обязанностями, на человека возложена адекватная и подъемная ответственность, с учетом его положения. По этой причине исламские ученые сделали условием обременения закятом и садака аль-фитр владение имуществом в размере нисаба, остающемся после трат человека на собственные основные потребности и потребности членов семьи, которых он обязан содержать."
        +"Основные потребности — это вещи, в которых человек нуждается для того, чтобы сохранить свою жизнь и свободу. К этим вещам относятся жилище, нафака (еда, питье, расходы на поддержание здоровья), транспорт, образование, мебель, инструменты и техника, необходимые для творчества и профессии, книги, средства по обеспечению безопасности, электричество, вода, горючее, квартплата и другие текущие расходы, а также денежные средства, выделенные на удовлетворение этих основных потребностей."},
      {"question":"Необходимо ли выплачивать закят с инструментов и средств, используемых в работе?",
        "answer":"Инструменты, техника и предметы, необходимые для реализации творчества и профессии входят в состав основных потребностей (аль-хаваидж аль-аслийя). Следовательно, с них не нужно выплачивать закят. Однако необходимо выплачивать закят с инструментов, техники и предметов, которые производятся или приобретаются для дальнейшей продажи, а не для ведения человеком его профессии."},
      {"question":"Каким образом производится расчет закята с имущества, предназначенного для продажи?",
      "answer":"Имущество, перепродаваемое с целью получения прибыли, называется «имущество, предназначенное для продажи». Человек, обладающий таким имуществом в размере эквивалентным 85 граммам золота, и при условии, что оно сохранится по истечении лунного года, обязан выплатить с него закят в размере одной сороковой части (2,5 %)."
      +"Закят выплачивается с имущества, реально или потенциально (существующая перед человеком задолженность) имеющегося в собственности, сохраняющегося по истечении лунного года и при соблюдении остальных условий. При расчете закята не учитывается прогнозируемый (предполагаемый) рост стоимости имущества. Тот же принцип актуален и для имущества, предназначенного для продажи. В этой связи, при выплате закята с имущества, предназначенного для продажи, не учитывается предполагаемая будущая прибыль с этого имущества, а учитывается лишь его финансовая ценность (рыночная стоимость) на момент продажи."},
      {"question":"Может ли выплачиваться закят с имущества, предназначенного для продажи, этим же имуществом?",
      "answer":"Закят с имущества, предназначенного для продажи, может выплачиваться как в денежном эквиваленте, так и частью этого имущества."},
      {"question":"Возможна ли выплата закята за скот деньгами?",
      "answer":"Закят со скота может быть выплачен как частью этого скота, так и деньгами. Однако предпочтительно выбрать то, что будет полезнее для нуждающегося."},
      {"question":"Являются ли украшения имуществом, с которого выплачивается закят?",
      "answer":"Украшения, изготовленные из золота и серебра, при совпадении остальных условий, по мнению ученых ханафитского мазхаба, подпадают под действие закята. В связи с чем, если эти украшения достигли или превысили 85 граммов в золотом либо 600 граммов в серебряном эквиваленте, и уцелели по истечении лунного года, то с них выплачивается закят в размере одной сороковой части. С ювелирных изделий, изготовленных из драгоценных камней либо драгоценных металлов помимо золота и серебра, закят не выплачивается."},
      {"question":"Как рассчитывается размер выплачиваемого закята у человека, располагающего золотом, имеющим разные пробы?",
      "answer":"Разница в пробе золота не имеет значения с точки зрения формирования нисаба. Ведь какой бы пробы не было золото, в итоге оно остается золотом. В соответствии с этим, если итоговый вес всех золотых изделий, даже если они имеют разные пробы, достигает 85 граммов, и соблюдены остальные условия, на них распространяется выплата закята. Однако в этом случае расчет размера выплаты закята в денежном эквиваленте производится с учетом того, что каждое изделие имеет разную стоимость, а не из расчета одной сороковой части общего веса этих изделий."},
      {"question":"Надлежит ли выплачивать закят с недвижимости, приобретенной в качестве инвестиций или с целью дальнейшей перепродажи?",
      "answer":"Недвижимость, имеющаяся в собственности с целью дальнейшей перепродажи, подпадает под выплату закята. В соответствии с этим, с недвижимости, имеющейся в собственности людей не для использования по прямому назначению, а для дальнейшей продажи, при условии, что оно хранится год по лунному календарю и его цена за вычетом долгов достигла нисаба, выплачивается закят в размере 2,5 % от их рыночной стоимости на момент выплаты."
      +"Закят с недвижимости, приобретенной в качестве инвестиций или с целью дальнейшей перепродажи, то есть для того, чтобы продать ее позднее, когда она вырастит в цене, выплачивается ежегодно исходя из ее рыночной стоимости. С земельных участков, купленных с намерением построить на них дом, магазин, огород, сад закят не выплачивается."},
      {"question":"Обязан ли агент по недвижимости выплачивать закят с недвижимости, находящейся в его собственности?",
      "answer":"Недвижимость, приобретаемая агентами с целью продажи, подпадает под выплату закята. Согласно этому, недвижимость, находящаяся в собственности агентов с целью продажи, при условии сохранения по истечении года и достижения размера нисаба за вычетом долгов, подвергается выплате закята в размере 2,5 % от рыночной стоимости на момент выплаты. Не обязательно, чтобы в течение года сохранялась каждая недвижимость по отдельности. Следовательно, после того как закят становится обязательным, производится расчет стоимости недвижимости, перешедшей в собственность, и остального движимого и недвижимого имущества, и выплачивается закят. При выплате закята с недвижимости, подпадающей под эти условия, берется за основу их рыночная стоимость на момент выплаты."},
      {"question":"Каким образом выплачивают закят совладельцы компаний?",
      "answer":"Поскольку компания является юридическим лицом, то закят выплачивает не сама компания, а ее совладельцы, если их доля по отдельности или вместе с остальным их имуществом, если таковое имеется, достигает размера нисаба. Согласно этому, человек, располагающий нисабом, помимо средств первой необходимости и денег на основные нужды, при условии, что нисаб сохранится по истечении года, должен выплатить закят.Стационарное оборудование (станки, инструменты и т. д.) компаний, ведущих деятельность в промышленном секторе освобождено от закята. Оборотные средства (полуфабрикаты, произведенная продукция, сырье, наличность, чеки и т.д.) вместе с чистой прибылью облагаются закятом в размере 2,5 %, после того, как будет вычтена финансовая ценность обязательств, расходов на материалы, производство, продажи, менеджмент, финансирование."
      +" Следовательно, совладелец такой компании должен выплатить закят, если размера  нисаба достигнет его доля в оборотных средствах и сохранится по истечении года, а не его доля в основных фондах (офисы, транспорт, оргтехника). То же самое справедливо для компаний, действующих в сфере торговли. Если акционеры делегируют обязанности по выплате закята руководству компании, руководство может выплатить закят с их доли по доверенности. В этом случает расчет стоимости закята происходит так, как будто плательщиком является физическое лицо (совокупность имущества всех совладельцев принимается в качестве имущества одного человека). Если компания не выплатила закят с долей, совладельцы должны сами этим заняться. Каждый год по лунному календарю составляется бухгалтерский баланс и производится инвентаризация. Рассчитывается стоимость оборотных средств, чеков, обязательств перед компанией, все это суммируется, вычитаются обязательства самой компании, если таковые имеются, и 2,5 % с этой суммы выплачиваются в виде закята."},
      {"question":"Необходимо ли выплачивать закят с акций?",
      "answer":"Человек, который приобрел акции какой-либо компании, становится совладельцем зданий, оборудования и инвентаря этой компании пропорционально количеству акций, находящихся в его собственности. В этом случае акционер также разделяет прибыль и убыток, которые может получить компания. Если дивиденды, достающиеся акционеру в случае получения прибыли, по отдельности или вместе с остальным его имуществом достигают размера нисаба и сохраняются по истечении года, то на них распространяется закят в размере 2,5%. Если эти акции были приобретены не с целью становления их держателем и получения дивидендов, а для перепродажи, они расцениваются как имущество, предназначенное для продажи. Если их цена по отдельности или вместе с остальным имуществом, на которое распространяется закят, достигает размера нисаба, то с них выплачивается закят в размере 2,5 % от их рыночной стоимости. "},
      {"question":"Какие долги вычитываются из стоимости имущества, подпадающего под выплату закята?",
      "answer":"Человек, обязанный выплатить закят, вычитывает с имущества, предварительно подпадающего под выплаты по нему, долги, затрагивающие права других людей. Согласно более распространённому мнению ханафитского мазхаба в этом вопросе, долги, день выплаты которых наступил и не наступил, подпадают под единую правовую оценку. Однако по мнению некоторых ханафитских ученых, из стоимости имущества, подпадающего под выплату закята, вычитаются лишь те долги, срок выплаты которых наступил и выплату которых уже начали требовать; долги, день возвращения которых еще не наступил, не вычитаются. Из выплаты закята также вычитается полная сумма таких современных видов долга, как кредит, ипотека, взносы в жилищно-строительные кооперативы, и т. п., которые погашаются на протяжении долгих лет. "}          
    ],
    };
  },
});
</script>
