<template>
  <div>
    <v-row justify="center">
      <v-expansion-panels popout>
        <v-expansion-panel
          v-for="question in questions"
          :key="question.questiontext"
        >
          <QuestionItem :question="question"/>
        </v-expansion-panel>
      </v-expansion-panels>
    </v-row>
  </div>
</template>
<script lang="ts">
import Vue from 'vue';
import QuestionItem from '@/components/Zakat/QuestionItem.vue';
export default Vue.extend({
  components: {
    QuestionItem,
  },
  data () {
    return {
      questions: [
        {
          question: 'Что такое закят?',
          answer: '«Закят» означает установленное количество средств, ' +
            'которое человек, обладающий имуществом в размере, принятом в религии признаком богатства (нисаб),' +
            ' должен передать определённым людям ради довольства Аллаха. Другими условиями обязательности закята,' +
            ' наряду с достижением имущества размера нисаба, являются актуальный или потенциальный рост этого ' +
            'имущества, его наличие по истечении лунного года, а также превосходство (излишек) над долговым ' +
            'обязательством и тратами на основные нужды (однодневная еда, одежда и др.).\n' +
            'Нисаб — это критерий богатства, взятый за основу для того, чтобы человек был обязан ' +
            'выплачивать закят. Размер нисаба равен 20 мискалям золота (85 гр.), 5 верблюдам, 30 коровам ' +
            'или быкам, 40 овцам или козлам.\n' +
            'В Благородном Куръане подробно разъяснено то, кому предназначен закят (сура ат-Тауба, аят 60), ' +
            'а об объеме нисаба сообщается в хадисах (Бухари, «Закят», 32, 36, 38, 43). В соответствии с чем, ' +
            'человек, обладающий имуществом в размере нисаба за вычетом трат на основные нужды, при соблюдении ' +
            'прочих условий, должен выплатить закят с этого имущества. \n'},
        {
          question: 'Для кого закят является обязательным? Каковы условия действительности закята?',
          answer: 'Условия, касающиеся поклонения в виде выплаты закята, рассматриваются под двумя отдельными ' +
              'заголовками: условия, при которых закят является для кого-либо обязательным, и условия ' +
              'действительности закята.\n Для того, чтобы закят являлся для некого человека обязательным,' +
              ' он должен быть мусульманином, дееспособным, совершеннолетним с точки зрения религии, свободным,' +
              ' обладателем имущества в размере нисаба, актуально или потенциально растущего, то есть приносящего' +
              ' прибыль, и превышающего его долги и расходы на основные потребности. Под «растущим»' +
              ' подразумевается обеспечение имуществом дохода, прибыли и пользы для его обладателя,' +
              ' или присущее ему свойство расти и приумножаться.\n' +
              'Кроме того, условием обязательности закята является сохранение имущества, достигшего размера' +
              ' нисаба, по истечении года по лунному календарю. Рост и падение, происходившие в течение года,' +
              ' не учитываются. Закят может быть выплачен и до наступления этого срока.\n' +
              'Что же касается условий действительности закята, в первую очередь обязателен ният (намерение).' +
              ' Закят не может быть признан состоявшимся без намерения, поскольку его выплата является актом ' +
              'поклонения. Кроме того, условием является «тамлик», означающий «передача имущества в собственность».' +
              ' Закят не будет засчитан, если просто разрешить поесть, приготовив еду и накормив ею бедняка, без ' +
              'соблюдения остальных условий.\n' }],
    };
  },
});
</script>
