<template>
  <div>
  <v-flex xs12 md6 class="text-center">
        <video rounded height="340px" controls>
          <source
            :src="require('@/assets/videos/aboutUs.mp4')"
            type="video/mp4"
          >Your browser does not support HTML5 video.
        </video>
  </v-flex>
    <div>
      <h3>Что такое закят?</h3>
      <p>«Закят» означает установленное количество средств, которое человек, обладающий имуществом в размере, принятом в религии признаком богатства
        <v-tooltip top max-width="400px">
        <template v-slot:activator="{ on }">
          <span v-on="on" style="color:red">нисаб</span>
        </template>
        <span>Нисаб — это критерий богатства, взятый за основу для того, чтобы человек был обязан выплачивать закят. Размер нисаба равен 20 мискалям золота (85 гр.), 5 верблюдам, 30 коровам или быкам, 40 овцам или козлам.</span>
      </v-tooltip>, должен передать определённым людям ради довольства Аллаха.</p>
      <p>В Благородном Куръане подробно разъяснено то, кому предназначен 
        <v-tooltip top max-width="400px">
        <template v-slot:activator="{ on }">
          <span v-on="on" style="color:red">закят</span>
        </template>
        <span>(сура ат-Тауба, аят 60)</span>
        </v-tooltip>, а об объеме нисаба сообщается в 
        <v-tooltip top max-width="400px">
        <template v-slot:activator="{ on }">
          <span v-on="on" style="color:red">хадисах</span>
        </template>
        <span>(Бухари, «Закят», 32, 36, 38, 43)</span>
        </v-tooltip>
         . В соответствии с чем, человек, обладающий имуществом в размере нисаба за вычетом трат на основные нужды, при соблюдении прочих условий, должен выплатить закят с этого имущества.</p>
      <p>Условия, касающиеся поклонения в виде выплаты закята, рассматриваются под двумя отдельными заголовками: условия, при которых закят является для кого-либо обязательным, и условия действительности закята.</p>
    
      <h3>Кто обязан выплатить закят? </h3>
      <h4>Чтобы закят являлся для некого человека обязательным, он должен быть:</h4>
      <p>- Мусильсанином</p>
      <p>- Дееспособнам</p>
      <p>- Совершеннолетним с точки зрения религии</p>
      <p>- Свободным</p>
      <p>- Обладает  
        <v-tooltip top max-width="400px">
        <template v-slot:activator="{ on }">
          <span v-on="on" style="color:red">имущества в размере нисаба</span>
        </template>
        <span>размер нисаба, актуально или потенциально растущего, то есть приносящего прибыль, и превышающего его долги и расходы на основные потребности. Под «растущим» подразумевается обеспечение имуществом дохода, прибыли и пользы для его обладателя, или присущее ему свойство расти и приумножаться.</span>
        </v-tooltip></p>
      <p>- Сохранение имущества, достигшего размера нисаба, по истечении года 
        <v-tooltip top max-width="400px">
        <template v-slot:activator="{ on }">
          <span v-on="on" style="color:red">по лунному каленьдарю</span>
        </template>
        <span>исламский календарь, заканчивается месяцем Зуль-хиджа</span>
        </v-tooltip>. При этом закят может быть  выпоачен и до наступления этого срока.</p>
      <p>
        Что же касается условий действительности закята, в первую очередь обязателен ният (намерение). Закят не может быть признан состоявшимся без намерения, поскольку его выплата является актом поклонения. Кроме того, условием является «тамлик», означающий «передача имущества в собственность». Закят не будет засчитан, если просто разрешить поесть, приготовив еду и накормив ею бедняка, без соблюдения остальных условий.
      </p>
    </div>
  </div>
</template>
<script>
import Vue from 'vue';
export default Vue.extend({
})
</script>