<template>
  <v-container>
    <v-row
    >
      <v-col
        cols="12"
        md="9"
      >
        <SpecificNewsCard
          :specificNews="news[this.$route.params.id - 1]"
        />
      </v-col>
      <v-col
        cols="12"
        md="3"
      >
        <GreyCard />
      </v-col>
    </v-row>
    <OtherNews class="my-10 mx-0" />
  </v-container>
</template>

<script>
import Vue from 'vue';
import SpecificNewsCard from '@/components/aboutNews/SpecificNewsCard';
import GreyCard from '@/components/aboutNews/GreyCard';
import OtherNews from '@/components/aboutNews/OtherNews';

export default Vue.extend({
  components: {
    SpecificNewsCard,
    GreyCard,
    OtherNews,
  },
  data () {
    return {
      news: [
        {
          id: 1,
          title: 'Вкусности для бездомных',
          content: 'Какие же настали морозные дни в нашей Казани. Особенно это чувствуют бездомные люди. Не всегда удается найти теплый ночлег. Единственным спасением становятся горячие бесплатные обеды. Добрый фудтрак и сотрудники «Закята» были встречены в сквере на Б.Шахиди с большой радостью в глазах. Мне вспоминается случай, как в одну из жестких морозных зим, один наш подопечный рассказывал мне, что все ночлежки были переполнены и он остался на улице в минус тридцать. Чтоб не замерзнуть он с одного конца Казани шел пешком в другой конец, и так провел долгие ночные часы. К утру он продрог и устал, но ночлега так и не было. Он не спал целые сутки. Сейчас у него все хорошо, он нашел работу, читает намаз и с удовольствием рассказывает как прекрасно ложиться вечером в чистую, теплую кровать. Недавно он приходил в гости и мы вспоминали с ним ту страшную ночь в его жизни, мы оба расплакались.',
          date: new Date(),
          author: 'Майя Бурганова',
          tags: [
            '#закят',
            '#вкусностидлябездомных',
            '#бфзакят',
            '#пункт_приема_пищи',
            '#zakat',
          ],
        },
        {
          id: 2,
          title: 'Назер — курбан для малоимущих',
          content: 'В фонд «Закят» принесли мясо барана назер-курбана. Сотрудники Закята распределили его подопечным семьям фонда «Закята». Среди благополучателей — многодетные матери, малоимущие, одинокие старики. Все подопечные благодарят за мясную продукцию и воздают дуа за благотворителей. Пусть Аллах одарит их барактом и дарует Рай. Амин. Мне вспоминается случай, как в одну из жестких морозных зим, один наш подопечный рассказывал мне, что все ночлежки были переполнены и он остался на улице в минус тридцать. Чтоб не замерзнуть он с одного конца Казани шел пешком в другой конец, и так провел долгие ночные часы. К утру он продрог и устал, но ночлега так и не было. Он не спал целые сутки. Сейчас у него все хорошо, он нашел работу, читает намаз и с удовольствием рассказывает как прекрасно ложиться вечером в чистую, теплую кровать. Недавно он приходил в гости и мы вспоминали с ним ту страшную ночь в его жизни, мы оба расплакались.',
          date: new Date(),
          author: 'Ринат Гарипов',
          tags: [
            '#закят',
            '#вкусностидлябездомных',
            '#бфзакят',
            '#пункт_приема_пищи',
            '#zakat',
          ],
        },
      ],
    };
  },
});
</script>
