<template>
  <v-card
    flat
    class="pa-5"
    style="border-radius: 10px;"
  >
    <v-img
      :src="require('~/assets/images/news/1.png')"
      height = "300px"
      style="border-radius: 10px;"
    >
    </v-img>
    <h1
      class="pa-0 mt-5"
    >
      {{ news[id-1].title }}
    </h1>
    <p class="mt-3 mb-2">{{ news[id-1].content_1 }}</p>
    <p class="mt-3 mb-2">{{ news[id-1].content_2 }}</p>
    <v-card-text
      class="pa-0 mb-5"
      style="color: #9da3a6;"
    >
      {{ localeDate }}
      <v-icon class="px-1" style="color: inherit;">
        mdi-circle-small
      </v-icon>
      {{ news[id-1].author }}
    </v-card-text>
    <v-row
      style="width: 80%;"
    >
      <v-col
        v-for="tag in news[id-1].tags"
        :key="tag"
        cols="auto"
        class="py-0"
      >
        <v-card-text
          class="pa-0"
          style="color: #00ac00;"
        >
          {{ tag }}
        </v-card-text>
      </v-col>
    </v-row>
  </v-card>
</template>

<script lang="ts">
import Vue from 'vue';

export default Vue.extend({
  props: {
    id: {
      type: Number,
      required: true,
    },
  },
  data () {
    return {
      news: [
        {
          title: 'Вкусности для бездомных',
          content_1: 'Какие же настали морозные дни в нашей Казани. Особенно это чувствуют бездомные люди. Не всегда\n' +
            '      удается найти теплый ночлег. Единственным спасением становятся горячие бесплатные обеды. Добрый фудтрак и\n' +
            '      сотрудники «Закята» были встречены в сквере на Б.Шахиди с большой радостью в глазах.',
          content_2: 'Мне вспоминается случай, как в одну из жестких морозных зим, один наш подопечный рассказывал мне, что все ночлежки были переполнены и он остался на улице в минус тридцать. Чтоб не замерзнуть он с одного конца Казани шел пешком в другой конец, и так провел долгие ночные часы. К утру он продрог и устал, но ночлега так и не было. Он не спал целые сутки. Сейчас у него все хорошо, он нашел работу, читает намаз и с удовольствием рассказывает как прекрасно ложиться вечером в чистую, теплую кровать. Недавно он приходил в гости и мы вспоминали с ним ту страшную ночь в его жизни, мы оба расплакались.',
          date: new Date(),
          author: 'Майя Бурганова',
          tags: [
            '#закят',
            '#вкусностидлябездомных',
            '#бфзакят',
            '#пункт_приема_пищи',
            '#пункт_приема_пищи',
          ],
        },
        {
          title: 'Назер — курбан для малоимущих',
          content_1: 'В фонд «Закят» принесли мясо барана назер-курбана. Сотрудники Закята распределили его подопечным семьям фонда «Закята». Среди благополучателей — многодетные матери, малоимущие, одинокие старики. Все подопечные благодарят за мясную продукцию и воздают дуа за благотворителей. Пусть Аллах одарит их барактом и дарует Рай. Амин.',
          content_2: 'Мне вспоминается случай, как в одну из жестких морозных зим, один наш подопечный рассказывал мне, что все ночлежки были переполнены и он остался на улице в минус тридцать. Чтоб не замерзнуть он с одного конца Казани шел пешком в другой конец, и так провел долгие ночные часы. К утру он продрог и устал, но ночлега так и не было. Он не спал целые сутки. Сейчас у него все хорошо, он нашел работу, читает намаз и с удовольствием рассказывает как прекрасно ложиться вечером в чистую, теплую кровать. Недавно он приходил в гости и мы вспоминали с ним ту страшную ночь в его жизни, мы оба расплакались.',

          date: new Date(),
          author: 'Ринат Гарипов',
          tags: [
            '#закят',
            '#вкусностидлябездомных',
            '#бфзакят',
            '#пункт_приема_пищи',
            '#пункт_приема_пищи',
          ],
        },
      ],
    };
  },
  computed: {
    localeDate (): string {
      return this.news[this.id - 1].date.toLocaleDateString(this.$i18n.locale, {
        year: 'numeric',
        month: 'long',
        day: 'numeric',
        hour: 'numeric',
        minute: 'numeric',
      });
    },
  },
});
</script>
