<template>
  <v-container>
    <h1 class="mb-3">Способы оплаты:</h1>

    <h2>Наличный расчёт</h2>
    <p>  Каждый желающий может прийти в офис нашего благотворительный фонда и пожертвовать деньги напрямую на сборы, садака или закят в виде наличных денег. Деньги перечисленные данным способом не будут отображаться на странице <a href="/reports">Отчеты.</a>
    </p>

    <h2>SMS</h2>
    <p>  На некоторых сборах есть возможности оплаты SMSом. Благотворитель может отправить SMS со специальным кодом по номеру телефона. Номер телефона и специальный код указаны в сборах. После того, как пользователь отправит деньги с его баланса номера телефона спишутся деньги.  Деньги перечисленные данным способом не будут отображаться на странице
      <a href="/reports">Отчеты.</a>
    </p>

    <h2>Банковской картой</h2>
    <p>  Для выбора оплаты сбора, садака или закят  с помощью банковской карты на соответствующей странице необходимо выбрать способ банковской картой. Оплата происходит через ПАО СБЕРБАНК с использованием банковских карт следующих платёжных систем:
    </p>
    <ul class="mb-5">
      <li>МИР <img width="40" src="../assets/payment-options/mir.png" alt=""></li>
      <li>VISA International <img width="40" src="../assets/payment-options/visa.png" alt=""></li>
      <li>Mastercard Worldwide <img width="40" src="../assets/payment-options/mastercard.svg" alt=""></li>
      <li>JCB <img width="30" src="../assets/payment-options/jcb.png" alt=""></li>
    </ul>

    <p>  Для оплаты (ввода реквизитов Вашей карты) Вы будете перенаправлены на платёжный шлюз ПАО СБЕРБАНК. Соединение с платёжным шлюзом и передача информации осуществляется в защищённом режиме с использованием протокола шифрования SSL. В случае если Ваш банк поддерживает технологию безопасного проведения интернет-платежей Verified By Visa, MasterCard SecureCode, MIR Accept, J-Secure, для проведения платежа также может потребоваться ввод специального пароля.
    </p>

    <p>  Настоящий сайт поддерживает 256-битное шифрование. Конфиденциальность сообщаемой персональной информации обеспечивается ПАО СБЕРБАНК. Введённая информация не будет предоставлена третьим лицам за исключением случаев, предусмотренных законодательством РФ. Проведение платежей по банковским картам осуществляется в строгом соответствии с требованиями платёжных систем МИР, Visa Int., MasterCard Europe Sprl, JCB.
    </p>
  </v-container>
</template>

<script>
    export default {
        name: "payment-options"
    }
</script>

<style scoped>

</style>
