<template>
  <v-container class="mt-10">
    <h1>ПУБЛИЧНАЯ ОФЕРТА</h1>
    <h2 class="mb-8">Благотворительного Фонда «Закят»</h2>

    <h3>1. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
    <p>
      Настоящая публичная оферта, именуемая в дальнейшем «Оферта», является предложением Благотворительного Фонда «Закят», именуемого
      в дальнейшем «Фонд», в лице Генерального директора Марданова Б.Р., действующего на основании Устава, заключить с любым, кто отзовётся на Оферту, договор пожертвования, именуемый в дальнейшем «Договор», на условиях, предусмотренных Офертой. Данное предложение является публичной офертой в соответствии с пунктом 2 статьи 437 Гражданского Кодекса РФ.

      1.2.Оферта вступает в силу со дня, следующего за днём размещения её на сайте Фонда в сети Интернет по адресу www.zakyatrt.ru.
      Оферта является бессрочной и действует до дня, следующего за днём размещения на Сайте извещения об отмене Оферты. Фонд вправе отменить Оферту в любое время
      .

      1.3.Фонд готов заключать договоры пожертвования в ином порядке и (или) на иных условиях, нежели это предусмотрено Офертой, для чего любое заинтересованное лицо вправе обратиться для заключения соответствующего договора в Фонд.
    </p>

    <h3>2. ПРЕДМЕТ ДОГОВОРА</h3>
    <p>
      2.1. По настоящему договору Благотворитель в качестве добровольного благотворительного пожертвования передаёт Фонду собственные денежные средства любым удобным для Благотворителя способом, а Фонд принимает благотворительное пожертвование и использует его для реализации Программы по благотворительной помощи Фонда. Факт передачи пожертвования свидетельствует о полном согласии Благотворителя с условиями настоящего договора.

      2.2. Осуществление благотворителем действий по настоящему договору признаётся пожертвованием в соответствии со статьёй 582 Гражданского кодекса Российской Федерации.

      2.3. Благотворитель безвозмездно передаёт Фонду денежные средства в размере, определенном Благотворителем, на осуществление Фондом Программы по благотворительной помощи. Благотворитель имеет право запросить и получить информацию о характере и размере необходимой помощи на конкретные цели.
    </p>
    <h3>3. ДЕЯТЕЛЬНОСТЬ ФОНДА</h3>
    <p>
      3.1. Фонд оказывает благотворительную помощь следующим целевым группам:

      1) беднякам, в том числе многодетным семьям, малообеспеченным пенсионерам, семьям;

      2) нищим, в том числе беженцам, лицам без определенного места жительства;

      3) сборщикам и распределителям Закята;

      4) должникам, кроме кредитных случаев;

      5) людям, посвятившим себя Исламу, изучению Корана (учителя, учащиеся);

      6) путникам (не имеющим регистрацию в городе Казани);

      7) детям и взрослым с ограниченными возможностями здоровья;

      8) лицам с тяжелыми заболеваниями;

      9) неполным семьям и иным лицам.

      3.2. Деятельность Фонда не имеет целью извлечение прибыли.

      3.3. Фонд публикует информацию о своей работе и отчёты о результатах деятельности на сайте www.zakyatrt.ru
    </p>
    <h3>4. ВНЕСЕНИЕ ПОЖЕРТВОВАНИЯ</h3>
    <p>
      4.1. Благотворитель самостоятельно определяет размер добровольного пожертвования и вносит его любым удобным способом, указанным на сайте www.zakyatrt.ru, на условиях настоящего Договора.

      4.2.1. Факт пересчисления пожертвования на счёт Фонда, в том числе путём отправки SMS-сообщения, в рамках проектов Фонда свидетельствует о полном согласии Благотворителя с условиями настоящего договора.

      4.2.2. При перечислении пожертвования для правильной идентификации плательщика Благотворитель указывает свои контакты: адрес электронной почты и/или телефонный номер.

      4.2.3. Датой акцепта Оферты, и, соответственно, датой заключения Договора является: дата поступления денежных средств Благотворителя на расчётный счёт Фонда.
    </p>
    <h3>5. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h3>
    <p>
      5.1. Фонд обязуется использовать полученные от Благотворителя по настоящему договору денежные средства строго в соответствии с действующим законодательством РФ и в рамках своей уставной деятельности.

      5.2. Благотворитель имеет право по своему усмотрению выбрать цель пожертвования, указав соответствующее назначение платежа при переводе пожертвования. Актуальный список целей пожертвования публикуется на сайте www.zakyatrt.ru, в социальных сетях и СМИ.

      5.3. При получении пожертвования без уточнения цели Фонд самостоятельно конкретизирует его использование, исходя из статей бюджета Благотворительной программы Фонда.

      5.4. При получении пожертвования с указанием цели, например, фамилии и имени нуждающегося, Фонд направляет пожертвование на помощь этому лицу. В случае, если сумма пожертвований конкретному лицу превысит сумму, необходимую для оказания помощи, Фонд информирует об этом Благотворителей, размещая информацию на сайте Фонда www.zakyatrt.ru. Фонд использует положительную разницу между суммой поступивших пожертвований и суммой, необходимой для оказания помощи конкретному лицу, на реализацию Благотворительной программы Фонда, сохраняя приоритет в использовании остатков средств на помощь другим лицам, нуждающимся в подобной помощи. Осуществляя пожертвование, Благотворитель соглашается с тем, что после выполнения указанной в пожертвовании цели Фонд самостоятельно определяет цели использования пожертвования в рамках Благотворительной программы Фонда.

      5.5. Пожертвования, полученные Фондом без указания конкретного назначения, направляются на реализацию Программы по благотворительной помощи Фонда в соответствии с Федеральным законом №135 от 11.08.1995г. «О благотворительной деятельности благотворительных организациях».

      5.6. Осуществляя пожертвование, Благотворитель соглашается с тем, что в соответствии с формулировкой статьи 16 пункта 3 Федерального закона №135 от 11.08.1995г. «О благотворительной деятельности и благотворительных организациях» Фонд имеет право использовать часть полученных средств для финансирования административных расходов в размере не более 20 процентов финансовых средств, расходуемых этой организацией за финансовый год. Данное ограничение не распространяется на оплату труда лиц, участвующих в реализации благотворительных программ.

      5.7. Благотворитель даёт Фонду согласие на обработку предоставленных Благотворителем при осуществлении добровольного пожертвования персональных данных (ФИО, адрес, место жительства, адрес электронной почты, банковские реквизиты), в том числе третьим лицам (на основании договора с Фондом), для целей исполнения настоящего договора, включая следующие действия: cбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных. Во всех остальных случаях Фонд обязуется не раскрывать третьим лицам личную информацию Благотворителя без его письменного согласия.
      Исключением являются требования данной информации государственными органами, имеющими полномочия требовать такую информацию. Согласие на обработку персональных данных действует до тех пор, пока Благотворитель не отзовёт его в письменном виде.

      5.8. Благотворитель имеет право на получение информации об использовании его пожертвования. Для реализации указанного права Фонд размещает на сайте www.zakyatrt.ru информацию о суммах пожертвований, полученных Фондом, с указанием фамилии, имени, отчества Благотворителя или наименования организации. По запросу Благотворителя Фонд подтверждает целевое использование полученных пожертвований соответствующими документами бухгалтерского учёта.

      5.9. Фонд не несёт перед Благотворителем иных обязательств, кроме обязательств, указанных в настоящем договоре.
    </p>
    <h3>6. ПРОЧИЕ УСЛОВИЯ</h3>
    <p>
      6.1. Любые споры и разногласия, возникшие между сторонами по настоящему договору, разрешаются путем переговоров. В случае невозможности разрешения спора путем переговоров, споры и разногласия могут решаться в соответствии с действующим законодательством Российской Федерации в судебных инстанциях по юридическому адресу Фонда.
    </p>
    <h3>7. РЕКВИЗИТЫ</h3>
    <p>
      Фонд является юридическим лицом.

      Полное наименование организации: Благотворительный Фонд «Закят»

      Сокращенное наименование организации: Фонд «Закят»

      ИНН 1655068682

      КПП 165501001

      ОГРН 1091600003153

      Банк ОТДЕЛЕНИЕ «БАНК ТАТАРСТАН» N8610 ПАО СБЕРБАНК Г. КАЗАНЬ

      К/с 30101810600000000603

      Р/с 40703.810.3.62190000764

      БИК 049205603

      Юридический адрес: 420111, РТ, г. Казань, ул. Лобачевского, д. 6.

      Фактический адрес: 420021, РТ, г. Казань, ул. Тукая, д. 89.

      Телефон: 89872253322

      Сайт www.zakyatrt.ru

      e-mail: fondzakyat@yandex.ru

      Генеральный директор Б.Р. Марданов
    </p>

  </v-container>
</template>

<script>
  export default {
    head: {
      title: 'Условия публичной оферты | Благотворительный фонд "Закят"',
    },
  }
</script>
